app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2019-03-08 02:13:31.906735"], ["updated_at", "2019-03-08 02:13:31.906735"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-08-23 21:44:13.062166"], ["updated_at", "2019-08-23 21:44:13.062166"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", "Caught Up in You"], ["LIMIT", 1]]
UPDATE "songs" SET "updated_at" = ?, "artist_id" = ? WHERE "songs"."id" = ?  [["updated_at", "2019-08-23 21:44:13.064222"], ["artist_id", 169], ["id", 2741]]
---
  def upload
    # binding.pry
    CSV.foreach(params[:file].path, headers: true) do |lead|
      @song = Song.create(title: lead[0])
      @song.artist = Artist.find_or_create_by(name: lead[1])
      @song.save